In [1]:
from pandas import DataFrame

In [2]:
data2={'Speed':[101,109,102],
      'Temp':[34,23,42],
      'Humidity':[230,740,520]}

In [3]:
frame2=DataFrame(data2)

In [4]:
frame2

   Speed  Temp  Humidity
0    101    34       230
1    109    23       740
2    102    42       520

In [6]:
frame2=frame2.reindex(columns=['Speed','Humidity','Temp'])

In [7]:
frame2

   Speed  Humidity  Temp
0    101       230    34
1    109       740    23
2    102       520    42

In [8]:
frame2.sort_index(axis=1)

   Humidity  Speed  Temp
0       230    101    34
1       740    109    23
2       520    102    42

In [9]:
frame2.sort_index(axis=1,ascending=False)

   Temp  Speed  Humidity
0    34    101       230
1    23    109       740
2    42    102       520

In [11]:
from pandas import Series

In [13]:
series2=Series([1200,1000,4000],index=['speed','Temp','Humidity'])

In [14]:
series2

speed       1200
Temp        1000
Humidity    4000
dtype: int64

In [16]:
series2.sort_values()

Temp        1000
speed       1200
Humidity    4000
dtype: int64

In [17]:
frame2

   Speed  Humidity  Temp
0    101       230    34
1    109       740    23
2    102       520    42

In [18]:
frame2.sort_values(by='Humidity')

   Speed  Humidity  Temp
0    101       230    34
2    102       520    42
1    109       740    23

In [19]:
frame2.sort_values(by='Temp')

   Speed  Humidity  Temp
1    109       740    23
0    101       230    34
2    102       520    42

In [20]:
frame2.sum()

Speed        312
Humidity    1490
Temp          99
dtype: int64

In [21]:
frame2.sum(axis=1)

0    365
1    872
2    664
dtype: int64